# YOLOv8n with CBAM - Light Version
# =================================
# CBAM integrated only at deeper layers (P4 and P5)
# This reduces feature suppression at early layers while maintaining attention benefits

nc: 2
names:
  0: helmet
  1: non-helmet

# Parameters
depth_multiple: 0.33
width_multiple: 0.25

# Backbone
backbone:
  # P1/2
  - [-1, 1, Conv, [64, 3, 2]]
  # P2/4
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  # NO CBAM - preserve early edge/texture features
  
  # P3/8
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  # NO CBAM - preserve mid-level features
  
  # P4/16
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, CBAM, [512]]          # CBAM at P4 only
  
  # P5/32
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CBAM, [1024]]         # CBAM at P5 only
  - [-1, 1, SPPF, [1024, 5]]

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]     # Concat with P4 CBAM output
  - [-1, 3, C2f, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]     # Concat with P3 output
  - [-1, 3, C2f, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [1024, False]]

  - [[18, 21, 24], 1, Detect, [nc]]
