nc: 2                 # number of classes (helmet, non-helmet)
depth_multiple: 0.33  
width_multiple: 0.25  

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          
  - [-1, 1, Conv, [128, 3, 2]]         
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, CBAM, [128]]               

  - [-1, 1, Conv, [256, 3, 2]]         
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, CBAM, [256]]               

  - [-1, 1, Conv, [512, 3, 2]]         
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, CBAM, [512]]               

  - [-1, 1, SPPF, [512, 5]]            

head:
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]

  - [[-1, 9, 13], 1, Detect, [nc]]
